// Ввести два целых числа a и b (a ≤ b) и вывести сумму квадратов всех чисел от a
// до b.
// Данные на входе:Два целых числа по модулю не больше 100
// Данные на выходе:Сумма квадратов от первого введенного числа до второго

// Пример No1
// Данные на входе:4 10
// Данные на выходе:371

// Пример No2
// Данные на входе:1 5
// Данные на выходе:55

#include <stdio.h>

int main(void)
{
    int a, b, sum = 0;
    printf("Введите два целых числа по модулю не больше 100: \n");

    scanf("%d%d", &a, &b);
    
    for (int i = a; i <= b; i++)
    {
        sum = sum + (i*i);  
    }
    printf("%d\n", sum);
    return 0;
}
